app/controllers/items_controller.rb

INSERT INTO "items" ("name", "done", "todo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Ruby"], ["done", 0], ["todo_id", 2], ["created_at", "2019-07-08 10:04:37.678635"], ["updated_at", "2019-07-08 10:04:37.678635"]]
---
    def create
        @todo.items.create!(item_params)

SELECT  "items".* FROM "items" WHERE "items"."todo_id" = ? AND "items"."id" = ? LIMIT ?  [["todo_id", 2], ["id", 1], ["LIMIT", 1]]
---
    def set_todo_item
        @item = @todo.items.find_by!(id: params[:id]) if @todo