app/controllers/todos_controller.rb

    def create
        @todo = Todo.create!(todo_params)
---
INSERT INTO "todos" ("title", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Schedule"], ["created_by", "Haider"], ["created_at", "2019-07-05 11:39:33.649694"], ["updated_at", "2019-07-05 11:39:33.649694"]]